---
kind: method
id: M:Autodesk.Revit.DB.TessellatedBuildIssue.MakesDataUnusable
source: html/60eedd37-6a15-9af4-cd05-d213748d06a0.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssue.MakesDataUnusable Method

Reports whether this issue makes some data unusable ('true')
 or is only shows that data format conventions were broken,
 but the data are still usable (false).

## Syntax (C#)
```csharp
public bool MakesDataUnusable()
```